# 简介
正则表达式是由普通字符（例如字符 a 到 z）以及特殊字符（称为"元字符"）组成的文字模式。模式描述在搜索文本时要匹配的一个或多个字符串。正则表达式作为一个模板，将某个字符模式与所搜索的字符串进行匹配。
# 语法
1. [ABC] 匹配 [...] 中的所有字符；  
2. [^ABC] 匹配除了 [...] 中字符的所有字符；  
3. [A-Z] 表示一个区间，匹配所有大写字母，[a-z] 表示所有小写字母；  
4. [\s\S] 匹配所有 \s是匹配所有空白符包括换行，\S表示非空白符，不包括换行；  
5. \w 匹配字母、下划线、数字，等价于[0-9a-zA-Z_]；  
6. `.` 匹配除换行符（\n、\r）之外的任何单个字符，相等于 [^\n\r]；  
7. `+` 表示匹配多个字符；  
8. `$` 表示匹配字符串的结尾位置；  
9. `()` 表示子表达式的开始和结束；  
10. `*` 匹配前面的子表达式零次或多次。要匹配 * 字符，请使用 \*；  
11. `?` 匹配前面的子表达式零次或一次，或指明一个非贪婪限定符。要匹配 ? 字符，请使用 \?;  
12. `[` 标记一个中括号表达式的开始；  
13. `^` 匹配输入字符串的开始位置，除非在方括号表达式中使用，当该符号在方括号表达式中使用时，表示不接受该方括号表达式中的字符集合；  
14. `|` 指明两项之间的一个选择；  
15. `{` 标记限定符表达式的开始。

```
.* 在一起就表示任意字符出现零次或多次;  
.*? 匹配任意数量的重复，但是在能使整个匹配成功的前提下使用最少的重复。
```

# 限定符
限定符用来指定正则表达式的一个给定组件必须要出现多少次才能满足匹配。有 * 或 + 或 ? 或 {n} 或 {n,} 或 {n,m} 共6种。  

